# RbsCurvetypeRoughnessParam Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
ParameterTypeId..::..RbsCurvetypeRoughnessParam Property
ParameterTypeId Class See Also
---
"Roughness"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsCurvetypeRoughnessParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsCurvetypeRoughnessParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsCurvetypeRoughnessParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace